Repository: xcv58/MacTools
Catalog: Plugins/ClipboardHistory/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# saved.error.plainTextUnavailable
source: 此已存项目不包含可粘贴的文本。
ar: لا يحتوي هذا العنصر المحفوظ على نص قابل للصق.
de: Dieses gespeicherte Element enthält keinen einfügbaren Text.
en: This saved item doesn’t contain pasteable text.
es: Este elemento guardado no contiene texto que se pueda pegar.
fr: Cet élément enregistré ne contient aucun texte pouvant être collé.
ja: この保存済み項目にはペースト可能なテキストがありません。
ko: 이 저장된 항목에는 붙여넣을 수 있는 텍스트가 없습니다.
pt: Este item salvo não contém texto que possa ser colado.
ru: Этот сохранённый объект не содержит текста для вставки.
tr: Bu kayıtlı öğe yapıştırılabilir metin içermiyor.
zh_hant: 此已儲存項目不包含可貼上的文字。

# saved.error.unknownMacro
source: 未知的片段变量：%@
ar: متغير مقتطف غير معروف: %@
de: Unbekannte Variable im Textbaustein: %@
en: Unknown snippet variable: %@
es: Variable de fragmento desconocida: %@
fr: Variable d’extrait inconnue : %@
ja: 不明なスニペット変数: %@
ko: 알 수 없는 스니펫 변수: %@
pt: Variável de trecho desconhecida: %@
ru: Неизвестная переменная фрагмента: %@
tr: Bilinmeyen parçacık değişkeni: %@
zh_hant: 未知的片段變數：%@

# saved.error.snippetTooLarge
source: 片段不能超过 %@。
ar: لا يمكن أن يتجاوز حجم المقتطف %@.
de: Ein Textbaustein darf %@ nicht überschreiten.
en: A snippet cannot exceed %@.
es: Un fragmento no puede superar %@.
fr: Un extrait ne peut pas dépasser %@.
ja: スニペットのサイズは %@ を超えられません。
ko: 스니펫은 %@을(를) 초과할 수 없습니다.
pt: Um trecho não pode exceder %@.
ru: Размер фрагмента не может превышать %@.
tr: Bir parçacık %@ boyutunu aşamaz.
zh_hant: 片段不能超過 %@。

# saved.kind.clip
source: 已存项目
ar: عنصر محفوظ
de: Gesichertes Element
en: Saved Item
es: Elemento guardado
fr: Élément enregistré
ja: 保存済み項目
ko: 저장된 항목
pt: Item salvo
ru: Сохранённый элемент
tr: Kayıtlı Öğe
zh_hant: 已儲存項目

# saved.kind.snippet
source: 片段
ar: مقتطف
de: Textbaustein
en: Snippet
es: Fragmento
fr: Extrait
ja: スニペット
ko: 스니펫
pt: Trecho
ru: Фрагмент
tr: Parçacık

# saved.remove
source: 取消保存片段
ar: إزالة من المحفوظات
de: Aus Gespeichert entfernen
en: Unsave Clip
es: Quitar de Guardado
fr: Retirer des éléments enregistrés
ja: 保存済みから削除
ko: 저장됨에서 제거
pt: Remover dos salvos
ru: Убрать из сохранённых
tr: Kaydı Kaldır
zh_hant: 取消儲存剪輯

# saved.save
source: 保存片段
ar: حفظ في المكتبة
de: In Bibliothek sichern
en: Save Clip
es: Guardar en la biblioteca
fr: Enregistrer dans la bibliothèque
ja: ライブラリに保存
ko: 보관함에 저장
pt: Salvar na biblioteca
ru: Сохранить в библиотеку
tr: Öğeyi Kaydet
zh_hant: 儲存剪輯

# saved.state.notSaved
source: 未保存
ar: غير محفوظ
de: Nicht gespeichert
en: Not Saved
es: No guardado
fr: Non enregistré
ko: 저장되지 않음
pt: Não salvo
ru: Не сохранено
tr: Kayıtlı Değil
zh_hant: 未儲存

# saved.search.placeholder
source: 搜索已存项目、标签或关键词
ar: البحث في العناصر أو الوسوم أو الكلمات المحفوظة
de: Gespeicherte Elemente, Tags oder Kürzel durchsuchen
en: Search saved items, tags, or keywords
es: Buscar elementos, etiquetas o palabras clave guardados
fr: Rechercher des éléments, étiquettes ou mots-clés enregistrés
ja: 保存済み項目、タグ、キーワードを検索
ko: 저장된 항목, 태그 또는 키워드 검색
pt: Pesquisar itens, etiquetas ou palavras-chave salvos
ru: Поиск сохранённых элементов, тегов или ключевых слов
tr: Kayıtlı öğelerde, etiketlerde veya anahtar sözcüklerde ara
zh_hant: 搜尋已儲存項目、標籤或關鍵字

# settings.data.clearHistory
source: 清除历史
ar: مسح السجل
de: Verlauf löschen
en: Clear History
es: Borrar historial
fr: Effacer l’historique
ja: 履歴を消去
ko: 기록 지우기
pt: Limpar histórico
ru: Очистить историю
tr: Geçmişi Temizle
zh_hant: 清除記錄

# settings.queue.shortcuts.description
source: 请先设置“粘贴下一个”；其他队列控制项为可选。
ar: عيّن «لصق التالي» أولًا؛ عناصر التحكم الأخرى اختيارية.
de: Zuerst „Nächstes einsetzen“ zuweisen; weitere Steuerelemente sind optional.
en: Assign Paste Next first; the other queue controls are optional.
es: Asigna primero Pegar siguiente; los demás controles son opcionales.
fr: Attribuez d’abord Coller le suivant ; les autres commandes sont facultatives.
ja: まず「次をペースト」を設定します。その他は任意です。
ko: 먼저 다음 붙여넣기를 지정하세요. 다른 제어는 선택 사항입니다.
pt: Atribua Colar próximo primeiro; os demais controles são opcionais.
ru: Сначала назначьте «Вставить следующее»; остальные команды необязательны.
tr: Önce “Sonrakini Yapıştır” kısayolunu atayın; diğer kuyruk denetimleri isteğe bağlıdır.
zh_hant: 請先設定「貼上下一個」；其他佇列控制項為選用。

# settings.queue.shortcuts.title
source: 粘贴队列快捷键
ar: اختصارات قائمة اللصق
de: Kurzbefehle für die Einfügewarteschlange
en: Paste Queue Shortcuts
es: Atajos de la cola de pegado
fr: Raccourcis de la file de collage
ja: ペーストキューのショートカット
ko: 붙여넣기 대기열 단축키
pt: Atalhos da fila de colagem
ru: Сочетания клавиш очереди вставки
tr: Yapıştırma Kuyruğu Kısayolları
zh_hant: 貼上佇列快速鍵

# queue.explicit.retentionNotice
source: 活动的显式粘贴队列会保留加密副本，直到队列完成或取消。
ar: تحتفظ قائمة اللصق الصريحة النشطة بنسخها المشفرة حتى تنتهي القائمة أو يتم إلغاؤها.
de: Eine aktive explizite Einfügewarteschlange behält ihre verschlüsselten Kopien, bis sie beendet oder abgebrochen wird.
en: An active explicit paste queue keeps its encrypted copies until the queue finishes or is canceled.
es: Una cola de pegado explícita activa conserva sus copias cifradas hasta que termine o se cancele.
fr: Une file de collage explicite active conserve ses copies chiffrées jusqu’à sa fin ou son annulation.
ja: 明示的なペーストキューが有効な間、完了またはキャンセルまで暗号化されたコピーが保持されます。
ko: 활성 명시적 붙여넣기 대기열은 완료되거나 취소될 때까지 암호화된 복사본을 유지합니다.
pt: Uma fila de colagem explícita ativa mantém suas cópias criptografadas até terminar ou ser cancelada.
ru: Активная явная очередь вставки хранит зашифрованные копии до завершения или отмены очереди.
tr: Etkin bir açık yapıştırma kuyruğu, kuyruk bitene veya iptal edilene kadar şifreli kopyalarını korur.
zh_hant: 使用中的明確貼上佇列會保留加密副本，直到佇列完成或取消。

# settings.saved.clear.confirm
source: 清除已存资料库
ar: مسح المكتبة المحفوظة
de: Bibliothek löschen
en: Clear Saved Library
es: Borrar biblioteca guardada
fr: Effacer la bibliothèque
ja: 保存済みライブラリを消去
ko: 저장된 보관함 지우기
pt: Limpar biblioteca salva
ru: Очистить библиотеку
tr: Kayıtlı Kitaplığı Temizle
zh_hant: 清除已儲存資料庫

# settings.saved.clear.message
source: 取消历史中剪辑的已存状态，并永久删除仅保存在已存中的剪辑。历史和片段会保留。此操作无法撤销。
ar: يزيل حالة الحفظ من القصاصات الموجودة في السجل ويحذف نهائيًا القصاصات المحفوظة غير الموجودة في السجل. يبقى السجل والمقتطفات. لا يمكن التراجع عن هذا الإجراء.
de: Entfernt den Gespeichert-Status von Clips im Verlauf und löscht ausschließlich gespeicherte Clips dauerhaft. Verlauf und Textbausteine bleiben erhalten. Dies kann nicht rückgängig gemacht werden.
en: Removes Saved status from clips in History and permanently deletes Saved-only clips. History and snippets are kept. This cannot be undone.
es: Quita el estado guardado de los clips del historial y elimina permanentemente los que solo están guardados. El historial y los fragmentos se conservan. Esta acción no se puede deshacer.
fr: Retire le statut enregistré des clips de l’historique et supprime définitivement ceux qui n’existent que dans les éléments enregistrés. L’historique et les extraits sont conservés. Cette action est irréversible.
ja: 履歴内のクリップの保存状態を解除し、保存済みにのみ存在するクリップを完全に削除します。履歴とスニペットは保持されます。この操作は取り消せません。
ko: 기록에 있는 클립의 저장 상태를 해제하고 저장됨에만 있는 클립을 영구 삭제합니다. 기록과 스니펫은 유지됩니다. 이 작업은 되돌릴 수 없습니다.
pt: Remove o estado salvo dos clipes no histórico e apaga permanentemente os clipes que estão apenas salvos. O histórico e os trechos são mantidos. Esta ação não pode ser desfeita.
ru: Снимает статус сохранения с клипов в истории и безвозвратно удаляет клипы, которых нет в истории. История и фрагменты остаются. Это действие нельзя отменить.
tr: Geçmişteki öğelerin Kayıtlı durumunu kaldırır ve yalnızca “Kayıtlı”da bulunan öğeleri kalıcı olarak siler. Geçmiş ve parçacıklar korunur. Bu işlem geri alınamaz.
zh_hant: 取消記錄中剪輯的已儲存狀態，並永久刪除僅保存在已儲存中的剪輯。記錄和片段會保留。此操作無法復原。

# settings.saved.clear.title
source: 清除已存资料库？
ar: هل تريد مسح المكتبة المحفوظة؟
de: Bibliothek löschen?
en: Clear Saved Library?
es: ¿Borrar la biblioteca guardada?
fr: Effacer la bibliothèque ?
ja: 保存済みライブラリを消去しますか？
ko: 저장된 보관함을 지우시겠습니까?
pt: Limpar biblioteca salva?
ru: Очистить библиотеку?
tr: Kayıtlı Kitaplık Temizlensin Mi?
zh_hant: 清除已儲存資料庫？

# settings.saved.expansion.description
source: 输入无歧义的完整片段关键词时立即替换。安全文本字段会被忽略。
ar: استبدال كلمة المقتطف الواضحة فورًا أثناء الكتابة. يتم تجاهل حقول النص الآمنة.
de: Eindeutige Snippet-Kürzel direkt beim Tippen ersetzen. Sichere Textfelder werden ignoriert.
en: Immediately replace an unambiguous snippet keyword as you type. Secure text fields are ignored.
es: Reemplaza al escribir una palabra clave de fragmento sin ambigüedad. Se omiten los campos de texto seguros.
fr: Remplace immédiatement les mots-clés d’extrait sans ambiguïté pendant la saisie. Les champs sécurisés sont ignorés.
ja: 曖昧さのないスニペットのキーワードを入力すると即座に置換します。セキュア入力欄は無視されます。
ko: 명확한 스니펫 키워드를 입력하면 즉시 바꿉니다. 보안 텍스트 필드는 무시합니다.
pt: Substitui imediatamente uma palavra-chave de trecho sem ambiguidade ao escrever. Os campos seguros são ignorados.
ru: Сразу заменяет однозначные ключевые слова фрагментов при вводе. Защищённые поля игнорируются.
tr: Belirsiz olmayan bir parçacık anahtar sözcüğünü siz yazarken anında değiştirir. Güvenli metin alanları yok sayılır.
zh_hant: 輸入無歧義的完整片段關鍵字時立即替換。安全文字欄位會被忽略。

# settings.saved.expansion.title
source: 展开片段关键词
ar: توسيع كلمات المقتطفات
de: Textbaustein-Kürzel erweitern
en: Expand Snippet Keywords
es: Expandir palabras clave de fragmentos
fr: Développer les mots-clés d’extrait
ja: スニペットキーワードを展開
ko: 스니펫 키워드 확장
pt: Expandir palavras-chave de trechos
ru: Раскрывать ключевые слова фрагментов
tr: Parçacık Anahtar Sözcüklerini Genişlet
zh_hant: 展開片段關鍵字

# settings.sequentialPaste.dismiss.10
source: 10 秒
ar: 10 ثوانٍ
de: 10 Sekunden
en: 10 seconds
es: 10 segundos
fr: 10 secondes
ko: 10초
pt: 10 segundos
ru: 10 секунд
tr: 10 saniye

# settings.sequentialPaste.dismiss.30
source: 30 秒
ar: 30 ثانية
de: 30 Sekunden
en: 30 seconds
es: 30 segundos
fr: 30 secondes
ko: 30초
pt: 30 segundos
ru: 30 секунд
tr: 30 saniye

# settings.sequentialPaste.dismiss.5
source: 5 秒
ar: 5 ثوانٍ
de: 5 Sekunden
en: 5 seconds
es: 5 segundos
fr: 5 secondes
ko: 5초
pt: 5 segundos
ru: 5 секунд
tr: 5 saniye

# settings.sequentialPaste.dismiss.description
source: 可移动 HUD 会在连续粘贴后自动出现。
ar: تظهر اللوحة القابلة للنقل تلقائيًا بعد اللصق المتتابع.
de: Das bewegliche HUD erscheint automatisch nach dem sequenziellen Einsetzen.
en: The movable HUD appears automatically after sequential paste.
es: El HUD móvil aparece automáticamente tras pegar en secuencia.
fr: L’affichage mobile apparaît automatiquement après un collage séquentiel.
ja: 移動可能なHUDは順番にペーストした後に自動的に表示されます。
ko: 이동 가능한 HUD는 순차 붙여넣기 후 자동으로 나타납니다.
pt: O HUD móvel aparece automaticamente após colar em sequência.
ru: Перемещаемый HUD появляется автоматически после последовательной вставки.
tr: Taşınabilir HUD, sıralı yapıştırmadan sonra otomatik olarak görünür.
zh_hant: 可移動 HUD 會在連續貼上後自動出現。

# settings.sequentialPaste.dismiss.never
source: 永不
ar: أبداً
de: Nie
en: Never
es: Nunca
fr: Jamais
ja: しない
ko: 안 함
pt: Nunca
ru: Никогда
tr: Hiçbir Zaman

# settings.sequentialPaste.dismiss.title
source: 队列 HUD 隐藏时间
ar: إخفاء لوحة الانتظار بعد
de: Warteschlangen-HUD ausblenden nach
en: Hide Queue HUD After
es: Ocultar HUD después de
fr: Masquer l’affichage après
ja: キューHUDを隠すまで
ko: 대기열 HUD 자동 숨기기
pt: Ocultar HUD após
ru: Скрывать HUD через
tr: Kuyruk HUD'ı Gizleme Süresi
zh_hant: 佇列 HUD 隱藏時間

# settings.sequentialPaste.hidePreview.description
source: HUD 中仅显示队列位置和控制项。
ar: أظهر موضع القائمة وعناصر التحكم فقط.
de: Nur Position und Steuerung im HUD anzeigen.
en: Show only queue position and controls in the HUD.
es: Muestra solo la posición y los controles.
fr: N’affichez que la position et les commandes.
ja: HUDには位置と操作だけを表示します。
ko: HUD에 대기열 위치와 제어기만 표시합니다.
pt: Mostre apenas a posição e os controles.
ru: Показывать только позицию и элементы управления.
tr: HUD'da yalnızca kuyruk konumunu ve denetimleri gösterir.
zh_hant: HUD 中僅顯示佇列位置和控制項。

# settings.sequentialPaste.hidePreview.title
source: 隐藏内容预览
ar: إخفاء معاينة المحتوى
de: Inhaltsvorschau ausblenden
en: Hide Content Preview
es: Ocultar vista previa
fr: Masquer l’aperçu
ja: 内容のプレビューを隠す
ko: 콘텐츠 미리보기 가리기
pt: Ocultar prévia
ru: Скрывать содержимое
tr: İçerik Önizlemesini Gizle
zh_hant: 隱藏內容預覽

# share.action
source: 共享
ar: مشاركة
de: Teilen
en: Share
es: Compartir
fr: Partager
ja: 共有
ko: 공유
pt: Compartilhar
ru: Поделиться
tr: Paylaş
zh_hant: 分享

# share.unavailable
source: 无法共享此剪贴板项目
ar: لا يمكن مشاركة عنصر الحافظة هذا
de: Dieses Zwischenablageelement kann nicht geteilt werden
en: This clipboard item can’t be shared
es: Este elemento no se puede compartir
fr: Cet élément ne peut pas être partagé
ja: このクリップボード項目は共有できません
ko: 이 클립보드 항목은 공유할 수 없습니다
pt: Este item não pode ser compartilhado
ru: Этим элементом нельзя поделиться
tr: Bu pano öğesi paylaşılamaz
zh_hant: 無法分享此剪貼簿項目

# shortcut.pasteSequentially.controlTitle
source: 粘贴下一个队列项目
ar: لصق عنصر قائمة الانتظار التالي
de: Nächsten Warteschlangeneintrag einsetzen
en: Paste Next Queue Item
es: Pegar siguiente elemento
fr: Coller l’élément suivant
ja: 次のキュー項目をペースト
ko: 다음 대기열 항목 붙여넣기
pt: Colar próximo item
ru: Вставить следующий элемент
tr: Sonraki Kuyruk Öğesini Yapıştır
zh_hant: 貼上下個佇列項目

# shortcut.pasteSequentially.description
source: 粘贴下一个队列项目，或从最近历史快照开始。
ar: الصق العنصر التالي أو ابدأ بلقطة من السجل الحديث.
de: Nächsten Eintrag einsetzen oder mit einem Schnappschuss des Verlaufs beginnen.
en: Paste the next queued item, or start with a snapshot of recent history.
es: Pega el siguiente elemento o inicia una copia del historial reciente.
fr: Collez l’élément suivant ou démarrez avec un instantané de l’historique récent.
ja: 次の項目をペーストするか、最近の履歴から開始します。
ko: 다음 항목을 붙여넣거나 최근 기록 스냅샷으로 시작합니다.
pt: Cole o próximo item ou inicie com o histórico recente.
ru: Вставить следующий элемент или начать со снимка недавней истории.
tr: Sonraki kuyruğa alınmış öğeyi yapıştırır ya da yakın geçmişin anlık görüntüsüyle başlar.
zh_hant: 貼上下個佇列項目，或從最近記錄快照開始。

# shortcut.pasteSequentially.groupDescription
source: 打开历史、粘贴纯文本，或逐项粘贴最近记录。
ar: افتح السجل أو الصق نصاً عادياً أو الصق العناصر واحداً تلو الآخر.
de: Verlauf öffnen, reinen Text einsetzen oder Einträge nacheinander einsetzen.
en: Open history, paste plain text, or paste recent entries one at a time.
es: Abre el historial, pega texto sin formato o elementos uno a uno.
fr: Ouvrez l’historique, collez du texte brut ou les éléments un par un.
ja: 履歴を開く、標準テキストでペースト、または項目を順番にペーストします。
ko: 기록 열기, 일반 텍스트 붙여넣기 또는 항목을 하나씩 붙여넣습니다.
pt: Abra o histórico, cole texto simples ou itens um a um.
ru: Открыть историю, вставить простой текст или элементы по одному.
tr: Geçmişi açın, düz metin yapıştırın veya son kayıtları tek tek yapıştırın.
zh_hant: 開啟記錄、貼上純文字，或逐項貼上最近項目。

# shortcut.pasteSequentially.title
source: 连续粘贴
ar: لصق بالتتابع
de: Nacheinander einsetzen
en: Paste Sequentially
es: Pegar en secuencia
fr: Coller en séquence
ja: 順番にペースト
ko: 순차 붙여넣기
pt: Colar em sequência
ru: Последовательная вставка
tr: Sıralı Yapıştırma
zh_hant: 連續貼上

# settings.saved.expansion.allowAccess
source: 允许访问
ar: السماح بالوصول
de: Zugriff erlauben
en: Allow Access
es: Permitir acceso
fr: Autoriser l’accès
ja: アクセスを許可
ko: 접근 허용
pt: Permitir acesso
ru: Разрешить доступ
tr: Erişime İzin Ver
zh_hant: 允許存取

# settings.saved.expansion.status.noKeywords
source: 无关键词
ar: لا توجد كلمات
de: Keine Kürzel
en: No Keywords
es: Sin palabras clave
fr: Aucun mot-clé
ja: キーワードなし
ko: 키워드 없음
pt: Sem palavras-chave
ru: Нет ключевых слов
tr: Anahtar Sözcük Yok
zh_hant: 無關鍵字

# settings.saved.expansion.status.off
source: 关闭
ar: متوقف
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끔
pt: Desativado
ru: Выкл.
tr: Kapalı
zh_hant: 關閉

# settings.saved.expansion.status.unavailable
source: 不可用
ar: غير متاح
de: Nicht verfügbar
en: Unavailable
es: No disponible
fr: Indisponible
ja: 利用不可
ko: 사용 불가
pt: Indisponível
ru: Недоступно
tr: Kullanılamıyor
zh_hant: 無法使用

# settings.snippets.clear
source: 删除片段
ar: حذف المقتطفات
de: Textbausteine löschen
en: Delete Snippets
es: Eliminar fragmentos
fr: Supprimer les extraits
ja: スニペットを削除
ko: 스니펫 삭제
pt: Apagar trechos
ru: Удалить фрагменты
tr: Parçacıkları Sil
zh_hant: 刪除片段

# settings.snippets.clear.confirm
source: 删除片段
ar: حذف المقتطفات
de: Textbausteine löschen
en: Delete Snippets
es: Eliminar fragmentos
fr: Supprimer les extraits
ja: スニペットを削除
ko: 스니펫 삭제
pt: Apagar trechos
ru: Удалить фрагменты
tr: Parçacıkları Sil
zh_hant: 刪除片段

# settings.snippets.clear.message
source: 永久删除所有片段及其关键词。历史和已存剪辑会保留。此操作无法撤销。
ar: يحذف نهائيًا جميع المقتطفات وكلماتها المفتاحية. يبقى السجل والقصاصات المحفوظة. لا يمكن التراجع عن هذا الإجراء.
de: Löscht alle Textbausteine und ihre Kürzel dauerhaft. Verlauf und gespeicherte Clips bleiben erhalten. Dies kann nicht rückgängig gemacht werden.
en: Permanently deletes all snippets and their keywords. History and Saved clips are kept. This cannot be undone.
es: Elimina permanentemente todos los fragmentos y sus palabras clave. El historial y los clips guardados se conservan. Esta acción no se puede deshacer.
fr: Supprime définitivement tous les extraits et leurs mots-clés. L’historique et les clips enregistrés sont conservés. Cette action est irréversible.
ja: すべてのスニペットとキーワードを完全に削除します。履歴と保存済みクリップは保持されます。この操作は取り消せません。
ko: 모든 스니펫과 키워드를 영구 삭제합니다. 기록과 저장한 클립은 유지됩니다. 이 작업은 되돌릴 수 없습니다.
pt: Apaga permanentemente todos os trechos e suas palavras-chave. O histórico e os clipes salvos são mantidos. Esta ação não pode ser desfeita.
ru: Безвозвратно удаляет все фрагменты и их ключевые слова. История и сохранённые клипы остаются. Это действие нельзя отменить.
tr: Tüm parçacıkları ve anahtar sözcüklerini kalıcı olarak siler. Geçmiş ve kayıtlı öğeler korunur. Bu işlem geri alınamaz.
zh_hant: 永久刪除所有片段及其關鍵字。記錄和已儲存剪輯會保留。此操作無法復原。

# settings.snippets.clear.title
source: 删除所有片段？
ar: حذف كل المقتطفات؟
de: Alle Textbausteine löschen?
en: Delete All Snippets?
es: ¿Eliminar todos los fragmentos?
fr: Supprimer tous les extraits ?
ja: すべてのスニペットを削除しますか？
ko: 모든 스니펫을 삭제할까요?
pt: Apagar todos os trechos?
ru: Удалить все фрагменты?
tr: Tüm Parçacıklar Silinsin Mi?
zh_hant: 刪除所有片段？

# settings.snippets.count
source: %d 个片段
ar: %d مقتطفات
de: %d Textbausteine
en: %d snippets
es: %d fragmentos
fr: %d extraits
ja: %d 個のスニペット
ko: 스니펫 %d개
pt: %d trechos
ru: Фрагментов: %d
tr: %d parçacık
zh_hant: %d 個片段

# settings.snippets.description
source: 可复用的可编辑模板，支持可选关键词、标签和粘贴时变量。
ar: قوالب قابلة لإعادة الاستخدام مع كلمات وتوسيمات ومتغيرات وقت اللصق.
de: Wiederverwendbare Vorlagen mit optionalen Kürzeln, Tags und Variablen beim Einsetzen.
en: Reusable editable templates with optional keywords, tags, and paste-time variables.
es: Plantillas editables reutilizables con palabras clave, etiquetas y variables al pegar.
fr: Modèles modifiables réutilisables avec mots-clés, tags et variables au collage.
ja: キーワード、タグ、ペースト時変数に対応した再利用可能な編集用テンプレートです。
ko: 키워드, 태그, 붙여넣기 시점 변수를 지원하는 재사용 가능한 편집 템플릿입니다.
pt: Modelos editáveis reutilizáveis com palavras-chave, etiquetas e variáveis ao colar.
ru: Редактируемые шаблоны с ключевыми словами, тегами и переменными при вставке.
tr: İsteğe bağlı anahtar sözcükler, etiketler ve yapıştırma zamanı değişkenleri içeren, yeniden kullanılabilir düzenlenebilir şablonlar.
zh_hant: 可重複使用的可編輯範本，支援選用關鍵字、標籤與貼上時變數。

# snippet.createFromClip
source: 从片段创建文本片段…
ar: إنشاء مقتطف من النسخة…
de: Textbaustein aus Clip erstellen…
en: Create Snippet from Clip…
es: Crear fragmento desde el clip…
fr: Créer un extrait depuis le clip…
ja: クリップからスニペットを作成…
ko: 클립에서 스니펫 생성…
pt: Criar trecho do clipe…
ru: Создать фрагмент из клипа…
tr: Öğeden Parçacık Oluştur…
zh_hant: 從剪輯建立片段…

# source.otherDevice
source: 其他设备
ar: جهاز آخر
de: Anderes Gerät
en: Other Device
es: Otro dispositivo
fr: Autre appareil
ja: ほかのデバイス
ko: 다른 기기
pt: Outro dispositivo
ru: Другое устройство
tr: Diğer Aygıt
zh_hant: 其他裝置

# source.universalClipboard
source: 通用剪贴板
ar: الحافظة العامة
de: Universelle Zwischenablage
en: Universal Clipboard
es: Portapapeles universal
fr: Presse-papiers universel
ja: ユニバーサルクリップボード
ko: 공통 클립보드
pt: Área de transferência universal
ru: Универсальный буфер обмена
tr: Evrensel Pano
zh_hant: 通用剪貼板

# hud.quickPaste.accessibilityRequired
source: 快捷粘贴需要辅助功能权限
ar: يتطلب اللصق السريع إذن تسهيلات الاستخدام
de: Schnelleinfügen benötigt Bedienungshilfen-Zugriff
en: Quick Paste requires Accessibility permission
es: Pegado rápido requiere permiso de Accesibilidad
fr: Le collage rapide nécessite l’accès Accessibilité
ja: クイックペーストにはアクセシビリティの許可が必要です
ko: 빠른 붙여넣기에 손쉬운 사용 권한이 필요합니다
pt: Colagem rápida requer permissão de Acessibilidade
ru: Для быстрой вставки нужен доступ к Универсальному доступу
tr: Hızlı Yapıştırma Erişilebilirlik izni gerektirir
zh_hant: 快速貼上需要輔助使用權限

# hud.quickPaste.failed
source: 无法粘贴快捷粘贴项目
ar: تعذر لصق العنصر
de: Schnelleinfügen fehlgeschlagen
en: Couldn’t paste Quick Paste item
es: No se pudo pegar el elemento
fr: Impossible de coller l’élément
ja: クイックペーストの項目をペーストできませんでした
ko: 빠른 붙여넣기 항목을 붙여넣지 못했습니다
pt: Não foi possível colar o item
ru: Не удалось вставить элемент
tr: Hızlı Yapıştırma öğesi yapıştırılamadı
zh_hant: 無法貼上快速貼上項目

# hud.quickPaste.unavailable
source: 快捷粘贴项目不可用
ar: عنصر اللصق السريع غير متاح
de: Schnelleinfügen-Eintrag nicht verfügbar
en: Quick Paste item is unavailable
es: Elemento de pegado rápido no disponible
fr: Élément de collage rapide indisponible
ja: クイックペーストの項目は利用できません
ko: 빠른 붙여넣기 항목을 사용할 수 없습니다
pt: Item da colagem rápida indisponível
ru: Элемент быстрой вставки недоступен
tr: Hızlı Yapıştırma öğesi kullanılamıyor
zh_hant: 快速貼上項目無法使用

# itemShortcut.assign.action
source: 分配快捷键
ar: تعيين اختصار
de: Kurzbefehl zuweisen
en: Assign Shortcut
es: Asignar atajo
fr: Attribuer un raccourci
ja: ショートカットを割り当て
ko: 단축키 지정
pt: Atribuir atalho
ru: Назначить сочетание
tr: Kısayol Ata
zh_hant: 設定快捷鍵

# itemShortcut.assigned
source: 已分配项目快捷键
ar: تم تعيين اختصار للعنصر
de: Kurzbefehl für Element zugewiesen
en: Item shortcut assigned
es: Atajo asignado al elemento
fr: Raccourci attribué à l’élément
ja: 項目のショートカットを設定しました
ko: 항목 단축키가 지정되었습니다
pt: Atalho atribuído ao item
ru: Сочетание для элемента назначено
tr: Öğe kısayolu atandı
zh_hant: 已設定項目快捷鍵

# itemShortcut.busy
source: 剪贴板正忙
ar: الحافظة مشغولة
de: Zwischenablage ist beschäftigt
en: Clipboard is busy
es: El portapapeles está ocupado
fr: Le presse-papiers est occupé
ja: クリップボードは使用中です
ko: 클립보드가 사용 중입니다
pt: A área de transferência está ocupada
ru: Буфер обмена занят
tr: Pano meşgul
zh_hant: 剪貼簿忙碌中

# itemShortcut.edit.action
source: 编辑快捷键
ar: تعديل الاختصار
de: Kurzbefehl bearbeiten
en: Edit Shortcut
es: Editar atajo
fr: Modifier le raccourci
ja: ショートカットを編集
ko: 단축키 편집
pt: Editar atalho
ru: Изменить сочетание
tr: Kısayolu Düzenle
zh_hant: 編輯快捷鍵

# itemShortcut.recordFirst
source: 请先录入快捷键。
ar: سجّل اختصارًا أولاً.
de: Nimm zuerst einen Kurzbefehl auf.
en: Record a shortcut first.
es: Graba primero un atajo.
fr: Enregistrez d’abord un raccourci.
ja: 先にショートカットを記録してください。
ko: 먼저 단축키를 입력하세요.
pt: Grave primeiro um atalho.
ru: Сначала запишите сочетание клавиш.
tr: Önce bir kısayol kaydedin.
zh_hant: 請先錄入快捷鍵。

# itemShortcut.recordUnavailable
source: 快捷键设置不可用。
ar: إعدادات الاختصارات غير متاحة.
de: Kurzbefehleinstellungen sind nicht verfügbar.
en: Shortcut settings are unavailable.
es: Los ajustes de atajos no están disponibles.
fr: Les réglages des raccourcis sont indisponibles.
ja: ショートカット設定を使用できません。
ko: 단축키 설정을 사용할 수 없습니다.
pt: As definições de atalhos estão indisponíveis.
ru: Настройки сочетаний недоступны.
tr: Kısayol ayarları kullanılamıyor.
zh_hant: 快捷鍵設定無法使用。

# itemShortcut.removed
source: 已移除项目快捷键
ar: تمت إزالة اختصار العنصر
de: Kurzbefehl für Element entfernt
en: Item shortcut removed
es: Atajo del elemento eliminado
fr: Raccourci de l’élément supprimé
ja: 項目のショートカットを削除しました
ko: 항목 단축키가 제거되었습니다
pt: Atalho do item removido
ru: Сочетание для элемента удалено
tr: Öğe kısayolu kaldırıldı
zh_hant: 已移除項目快捷鍵
